In [8]:
import pandas as pd
import numpy as np

df = pd.DataFrame({"gruplar": ["A", "B", "C","A", "B", "C"],
                  "degisken1" : [10,23,33,22,11,99],
                  "degisken2" : [100,253,33,262,11,969]}, columns = ["gruplar", "degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33         33
3       A         22        262
4       B         11         11
5       C         99        969

In [ ]:
#apply şu işe yarar; transforma olduğu gibi her eleman üzerinde gezinecek
#bir fonksiyon çalıştırabilme olanağı sağlar.

In [6]:
df.apply(np.sum)

gruplar      ABCABC
degisken1       198
degisken2      1628
dtype: object

In [10]:
df.groupby("gruplar").apply(np.mean)

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      132.0
C             66.0      501.0

In [9]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        264
C            CC        132       1002